toarous/multiboot.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>multiboot.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/toarous/mem.org.html">Prev: mem.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/toarous">Up: toarous</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/toarous/osx-environment.org.html">Next: osx-environment.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="overview">Overview</h1>
<ul class="incremental">
<li>Git version: <code>0da56e6e516b61704dcce834b9afb1e3192371f2</code></li>
<li>Sources
<ul class="incremental">
<li><code>kernel/include/multiboot.h</code></li>
<li><code>kernel/core/multiboot.c</code></li>
<li><code>kernel/main.c</code></li>
</ul></li>
<li>Specification: multibook1</li>
</ul>
<h1 id="background">Background</h1>
<p>Specification for OS implement that can be load by boot loader support this multiboot method.</p>
<h2 id="qemu-boot-loader">Qemu boot loader</h2>
<div class="sourceCode" id="cb1"><pre class="sourceCode bash"><code class="sourceCode bash"><span id="cb1-1"><a href="#cb1-1"></a><span class="ex">qemu-system-i386</span> -kernel toaruos-kernel -initrd toaruos-initrd</span></code></pre></div>
<h1 id="parameters">Parameters</h1>
<pre><code>MULTIBOOT header at 0x00009500:
Flags : 0x0000024f Mem Lo: 0x0000027f Mem Hi: 0x0001fb80 Boot d: 0x8000ffff
cmdlin: 0x0010d01f Mods  : 0x00000001 Addr  : 0x0010d000 Syms  : 0x00000000
Syms  : 0x00000000 Syms  : 0x00000000 Syms  : 0x00000000 MMap  : 0x00000090
Addr  : 0x00009000 Drives: 0x00000000 Addr  : 0x00000000 Config: 0x00000000
Loader: 0x0010d02f APM   : 0x00000000 VBE Co: 0x00000000 VBE Mo: 0x00000000
VBE In: 0x00000000 VBE se: 0x00000000 VBE of: 0x00000000 VBE le: 0x00000000
</code></pre>
<h2 id="initrd">initrd</h2>
<p>bit 3 of the <code>flags</code> is set, then the <code>mods</code> fields indicate to the kernel what boot modules were loaded along with the kernel image.</p>
<p>So in <code>main.c</code>, kernel load the initrd to ramdisk (memory from <code>mod_start</code> to <code>mod_end</code>) defined by the struct shows below</p>
<pre><code>struct {
    uintptr_t mod_start;
    uintptr_t mod_end;
    uintptr_t string; // command 
    uint32 reversed;  // always 0
}
</code></pre>
<p>And then mount it as ext2 filesystem.</p>
<h1 id="reference">Reference</h1>
<ul class="incremental">
<li><a href="https://www.gnu.org/software/grub/manual/multiboot/multiboot.html">Multiboot1 Specification</a></li>
</ul>

      </div>
    </section>
  </body>
</html>
